// пример1
// сначала значение переменной а увеличивается на единицу, затем значение переменной а присваивается переменной с
// пример2
// сначала значение переменной b присваивается переменной d, затем увеличивается на единицу
// пример3
// переменная а увеличивается на единицу, затем складывается с цифрой 2. Результат присваивается переменной с
// пример4
// переменная b складывается с цифрой 2, затем результат присваивается переменной d. В последнюю очередь переменная
// b увеличивается на единицу